webtemplates/FEDEX.TRACK.XML

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/track/v4">
<SOAP-ENV:Body>
<TrackRequest><WebAuthenticationDetail><UserCredential><Key>[FEDEX.KEY]</Key><Password>[FEDEX.PASSWORD]</Password></UserCredential></WebAuthenticationDetail><ClientDetail><AccountNumber>[FEDEX.ACCT]</AccountNumber><MeterNumber>[FEDEX.METER]</MeterNumber><Localization><LanguageCode>EN</LanguageCode></Localization></ClientDetail><TransactionDetail><CustomerTransactionId>Ground Track</CustomerTransactionId><Localization><LanguageCode>EN</LanguageCode></Localization></TransactionDetail><Version><ServiceId>trck</ServiceId><Major>4</Major><Intermediate>0</Intermediate><Minor>0</Minor></Version><PackageIdentifier><Value>[TRACK.NO]</Value><Type>TRACKING_NUMBER_OR_DOORTAG</Type></PackageIdentifier></TrackRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
